function DvdBptSubBp(A,k,l,Z)
%将位图A分割成(m/k)*(n/l)个子图，每个子图大小是k*l k是高，l是长
%对每个子图修改后得到Z  重新给用Z给A赋值

%--------------------------------------------------------------------------
dim=size(A);  %dim是由矩阵A的维数组成的向量
m_subbp=floor(dim(1)/k);
n_subbp=floor(dim(2)/l);
%--------------------------------------------------------------------------


%--------------------------------------------------------------------------
%开始重新给矩阵A附值
for i=1:m_subbp*n_subbp  %1:m_subbp*n_subbp
    row=ceil(i/n_subbp);%第i个子图所在行
    column=n_subbp-(row*n_subbp-i);%第i个子图所在列
    B=ones(k,l); %一个子图
    for j=1:l
        Zi=Z(i,:);
        B(:,j)=( Zi( (j-1)*k+1:k*j) )';
    end
    A(((row-1)*k+1):row*k,((column-1)*l+1):column*l)=B;
end
%--------------------------------------------------------------------------





    
    
    